app/controllers/bookalawns_controller.rb

SELECT "bookalawns".* FROM "bookalawns" WHERE (('2013-12-01 00:00:00.000000' <= end_at) AND (start_at< '2014-01-05 00:00:00.000000')) ORDER BY start_at ASC
---
  def index
    @title = "Book a Lawn"
    @bookalawns = Bookalawn.all

INSERT INTO "bookalawns" ("created_at", "end_at", "lawn", "start_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create
    @bookalawn = Bookalawn.new(bookalawn_params)

    respond_to do |format|
      if @bookalawn.save

DELETE FROM "bookalawns" WHERE "bookalawns"."id" = ?  [["id", 3]]
---
  def destroy
    @bookalawn.destroy

SELECT "bookalawns".* FROM "bookalawns" WHERE "bookalawns"."id" = ? LIMIT 1  [["id", "5"]]
---
    def set_bookalawn
      @bookalawn = Bookalawn.find(params[:id])