app/controllers/newsletters_controller.rb

  def index
    @title = "Newsletters"
    @newsletters = Newsletter.all(:group =>'date')
---
SELECT "newsletters".* FROM "newsletters" GROUP BY date ORDER BY date DESC

  def create
    @newsletter = Newsletter.new(newsletter_params)

    respond_to do |format|
      if @newsletter.save
---
INSERT INTO "newsletters" ("created_at", "date", "pdf", "title", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Thu, 21 Nov 2013 01:45:51 UTC +00:00], ["date", Thu, 21 Nov 2013], ["pdf", "Test_document_PDF.pdf"], ["title", "Test"], ["updated_at", Thu, 21 Nov 2013 01:45:51 UTC +00:00]]

  def update
    respond_to do |format|
      if @newsletter.update(newsletter_params)
---
UPDATE "newsletters" SET "pdf" = ?, "updated_at" = ? WHERE "newsletters"."id" = 14  [["pdf", "Test_document_PDF.pdf"], ["updated_at", Thu, 21 Nov 2013 14:12:39 UTC +00:00]]

  def destroy
    @newsletter.destroy
---
DELETE FROM "newsletters" WHERE "newsletters"."id" = ?  [["id", 2]]

    def set_newsletter
      @newsletter = Newsletter.find(params[:id])
---
SELECT "newsletters".* FROM "newsletters" WHERE "newsletters"."id" = ? LIMIT 1  [["id", "2"]]