app/controllers/programme2013s_controller.rb

SELECT "programme2013s".* FROM "programme2013s" WHERE (date >= '2013-11-19')
---
  def index
    @title =  Time.now.year
    #The date is included into the ? by ActiveRecord, which also extracts the day for us. Thus, only the present (today's) and future events are shown up, the rest are hidden.
    @programme2013s = Programme2013.where("date >= ?", Date.today)

INSERT INTO "programme2013s" ("created_at", "date", "description", "title", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Tue, 19 Nov 2013 16:15:41 UTC +00:00], ["date", Tue, 19 Nov 2013], ["description", ""], ["title", ""], ["updated_at", Tue, 19 Nov 2013 16:15:41 UTC +00:00]]
---
  def create
    @programme2013 = Programme2013.new(programme2013_params)

    respond_to do |format|
      if @programme2013.save

DELETE FROM "programme2013s" WHERE "programme2013s"."id" = ?  [["id", 1]]
---
  def destroy
    @programme2013.destroy

SELECT "programme2013s".* FROM "programme2013s" WHERE "programme2013s"."id" = ? LIMIT 1  [["id", "8"]]
---
    def set_programme2013
      @programme2013 = Programme2013.find(params[:id])